[
    {
        "buildNumber": 6726,
        "versionString": "Sprint 23",
        "dateString": "10-04-2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-23",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Surlignement HTML avec l'Aperçu en direct",
                "description": "En mode Aperçu en direct, placez votre curseur sur un élément HTML pour le surligner dans le navigateur. Vous pouvez activer/désactiver le surlignement en appuyant sur Ctrl+Maj+C ou ⇧⌘C. Cette fonctionnalité est actuellement disponible uniquement pour les fichiers dont les changements ont été sauvegardés."
            },
            {
                "name": "Nouvelle barre d'outils",
                "description": "Une nouvelle barre d'outils a été créée dans Brackets sur le côté droit. Elle remplace la barre de titre et les menus HTML supérieurs. Vous trouverez sur cette barre d'outils les icones du module Aperçu en direct et des autres extensions."
            },
            {
                "name": "Nouvelle version en Polonais et autres langues mises à jours",
                "description": "Brackets est maintenant disponible en Polonais. Les traductions en Français, Allemand, Tchèque et Chinois ont été mises à jour."
            }
        ]
    },
    {
        "buildNumber": 6428,
        "versionString": "Sprint 22",
        "dateString": "22-03-2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-22",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Installation plus facile des extensions",
                "description": "Installez les extensions dans l’interface utilisateur de Brackets en sélectionnant Fichier > Installer les extensions…. Vous devez obligatoirement indiquer l’URL d’un fichier ZIP ou d’un référentiel GitHub."
            },
            {
                "name": "Renvoi à la ligne",
                "description": "Le renvoi à la ligne est désormais activé par défaut. Pour activer/désactiver cette fonction, sélectionnez le menu Affichage > Activer le retour à la ligne."
            },
            {
                "name": "Afficher la ligne active",
                "description": "Le surlignage de la ligne active met en évidence la ligne sur laquelle le curseur est positionné. Pour activer/désactiver cette fonction, sélectionnez le menu Affichage > Afficher la ligne active."
            },
            {
                "name": "Masquer les numéros de ligne",
                "description": "Vous pouvez désormais masquer les numéros de ligne. Pour activer/désactiver cette fonction, sélectionnez le menu Affichage > Afficher les numéros de ligne."
            },
            {
                "name": "Fiabilité de la connexion Live Development",
                "description": "Des améliorations et des correctifs ont été appliqués afin que la connexion avec Chrome soit plus fiable et que les rapports d’erreurs soient générés plus efficacement."
            },
            {
                "name": "Traductions nouvelles/mises à jour",
                "description": "Il existe désormais une nouvelle traduction en chinois. Par ailleurs, les traductions en allemand, espagnol, français, italien et japonais ont été mises à jour."
            }
        ]
    },
    {
        "buildNumber": 5990,
        "versionString": "Sprint 21",
        "dateString": "01-03-2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-21",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Indicateurs de code JavaScript :",
                "description": "Les nouveaux indicateurs de code JavaScript comprennent des mots-clés, des variables locales, des arguments et des noms de propriétés."
            },
            {
                "name": "Live Development par défaut sur Localhost (avec Node.js)",
                "description": "Live Development utilise par défaut un serveur Web intégré avec node.js."
            },
            {
                "name": "Ouverture d’un fichier par glissement sur le Dock (OSX)",
                "description": "Pour ouvrir un fichier, faites-le directement glisser sur l’icône Brackets dans le dock."
            },
            {
                "name": "Ouverture de fichier par glisser-déposer (Windows)",
                "description": "Pour ouvrir un fichier, faites-le directement glisser dans Brackets."
            },
            {
                "name": "Mémorisation de la position du curseur et de la position de défilement",
                "description": "Les fichiers restés ouverts à la fermeture conservent la position du curseur et la position de défilement au démarrage. Au cours d’une même session, la position du curseur et la position de défilement sont restaurées à chaque réouverture de fichiers fermés."
            }
        ]
    },
    {
        "buildNumber": 5672,
        "versionString": "Sprint 20",
        "dateString": "14-02-2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-20",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Mise à niveau vers CodeMirror 3",
                "description": "L’éditeur de code principal a été mis à jour vers CodeMirror 3, ce qui a résolu plusieurs problèmes et permis l’ajout de nouvelles fonctionnalités."
            },
            {
                "name": "Amélioration des fonctions Annuler/Répéter",
                "description": "La fonction Annuler restaure la sélection précédente et rétablit la position du curseur."
            },
            {
                "name": "Numéros de lignes toujours visibles",
                "description": "Les numéros de ligne de la gouttière restent visibles en cas de défilement horizontal."
            },
            {
                "name": "Double/triple-cliquer et glisser",
                "description": "Double-cliquez ou triple-cliquez en faisant glisser le curseur pour sélectionner rapidement plusieurs mots/lignes."
            },
            {
                "name": "Amélioration des fonctions de recherche",
                "description": "Lorsque la barre de recherche est ouverte, tous les résultats sont mis en surbrillance. Le résultat actuel apparaît au centre de l’éditeur."
            }
        ]
    },
    {
        "buildNumber": 5290,
        "versionString": "Sprint 19",
        "dateString": "18-01-2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-19",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Barre de menu natif",
                "description": "Les menus apparaissent désormais dans les menus natifs Mac/Windows."
            },
            {
                "name": "Indicateurs de code CSS",
                "description": "Les indicateurs de code des propriétés et valeurs CSS sont maintenant disponibles pour les fichiers CSS et les blocs <style>."
            },
            {
                "name": "Amélioration des commandes Ouverture rapide et Atteindre la définition",
                "description": "Le classement des résultats et les temps de réponse des requêtes ont été améliorés."
            },
            {
                "name": "Modification des raccourcis clavier sous Mac",
                "description": "Le raccourci permettant de Commenter les blocs/Annuler les commentaires est maintenant ⌘⌥/. ⌘←, qui renvoyait auparavant vers l’accueil, fonctionne maintenant comme un raccourci d’accueil intelligent. Il déplace le curseur jusqu’au premier caractère (hors espace) de la ligne."
            },
            {
                "name": "Traductions nouvelles/mises à jour",
                "description": "De nouvelles traductions en suédois et en portugais ont été ajoutées. Les traductions en français, russe, espagnol et turc ont été mises à jour."
            }
        ]
    },
    {
        "buildNumber": 5070,
        "versionString": "Sprint 18",
        "dateString": "20-12-2012",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-18",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Amélioration de la fonction d’activation/désactivation des commentaires CSS/HTML",
                "description": "Plusieurs problèmes ont été résolus concernant le traitement de la fonction d’activation/désactivation des commentaires sur les lignes ou les blocs dans les fichiers CSS et HTML."
            },
            {
                "name": "Filtrage des attributs HTML dans les indicateurs de code",
                "description": "Lorsque vous affichez les indicateurs de code associés à des attributs, les attributs existants de la balise sont filtrés.."
            },
            {
                "name": "Renommer un fichier dans l’ensemble de documents de travail",
                "description": "En cliquant sur le fichier actif dans l’ensemble de documents de travail, vous avez désormais la possibilité de le renommer."
            },
            {
                "name": "Nouvelles traductions et mises à jour",
                "description": "Une nouvelle traduction en russe a été ajoutée à cette version. Par ailleurs, les traductions en allemand et en espagnol ont été mises à jour."
            }
        ]
    },
    {
        "buildNumber": 4728,
        "versionString": "Sprint 17",
        "dateString": "30-11-2012",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-17",
        "downloadURL": "https://github.com/adobe/brackets/downloads",
        "newFeatures": [
            {
                "name": "Sélecteur de couleurs en ligne",
                "description": "Lorsque vous placez le curseur sur une couleur hexadécimal, rgb() ou hsl(), vous pouvez utiliser les touches Ctrl+E ou ⌘E pour modifier cette couleur en ligne."
            },
            {
                "name": "Surlignage CSS dans l’Aperçu en direct",
                "description": "Lorsque le module Aperçu en direct est activé, si vous placez le curseur sur une règle dans un fichier CSS, les éléments concernés par cette règle apparaissent surlignés dans le navigateur."
            },
            {
                "name": "Commenter les blocs/Annuler les commentaires",
                "description": "Utilisez la combinaison Ctrl+Maj+/ ou ⌘⇧/ pour activer ou désactiver les commentaires relatifs aux blocs autour de la sélection active."
            },
            {
                "name": "Rechercher dans un fichier ou un dossier",
                "description": "Vous pouvez désormais lancer une recherche portant sur le contenu d’un fichier ou d’un dossier en cliquant sur \"Rechercher dans…\" dans le menu contextuel de l’arborescence de fichiers."
            },
            {
                "name": "Nouvelles traductions et mises à jour",
                "description": "Une nouvelle traduction de Brackets en turc a été ajoutée, tandis que les traductions en japonais, allemand, espagnol, français et italien ont été mises à jour (dans les deux cas, grâce aux contributions de la communauté d’utilisateurs)."
            }
        ]
    },
    {
        "buildNumber": 4439,
        "versionString": "Sprint 16",
        "dateString": "06-11-2012",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-16",
        "downloadURL": "https://github.com/adobe/brackets/downloads",
        "newFeatures": [
            {
                "name": "Mappage d’URL pour l’Aperçu en direct",
                "description": "Vous pouvez désormais utiliser l’Aperçu en direct avec le contenu du serveur en spécifiant une URL de base dans les paramètres du projet."
            },
            {
                "name": "Extensions stockées en dehors du dossier d’application",
                "description": "Les extensions sont désormais stockées par utilisateur. Windows : C:\\Utilisateurs\\<utilisateur>\\AppData\\Roaming\\Brackets\\extensions. Mac : /Users/<utilisateur>/Library/Application Support/Brackets/extensions."
            },
            {
                "name": "Tri et réorganisation de l’ensemble de documents de travail",
                "description": "Triez vos documents par nom, type ou heure d’ajout en choisissant l’option souhaitée dans le menu contextuel. Vous pouvez également réorganiser votre ensemble de documents à l’aide d’opérations de glisser-déposer."
            },
            {
                "name": "Nouvelles traductions et mises à jour",
                "description": "Une nouvelle traduction de Brackets en japonais a été ajoutée, tandis que la traduction en allemand a été mise à jour (dans les deux cas, grâce aux contributions de la communauté d’utilisateurs)."
            },
            {
                "name": "Fonction d’ouverture rapide améliorée",
                "description": "Désormais, la fonction Ouverture rapide fait porter la recherche sur le chemin d’accès complet (et non simplement sur le nom de fichier) ; elle accepte également les abréviations CamelCase et les résultats non contigus."
            }
        ]
    },
    {
        "buildNumber": 4083,
        "versionString": "Sprint 15",
        "dateString": "18-10-2012",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-15",
        "downloadURL": "https://github.com/adobe/brackets/downloads",
        "newFeatures": [
            {
                "name": "Barre d’état",
                "description": "Affiche les informations du curseur, la taille du fichier, le type de fichier, la notification JSLint, les préférences de mise en retrait et l’indicateur de chargement."
            },
            {
                "name": "Préférences de mise en retrait",
                "description": "Choisissez entre le retrait par tabulation ou par espace, et définissez la taille du retrait par rapport à la barre d’état."
            },
            {
                "name": "Rechargement automatique dans l’Aperçu en direct",
                "description": "Permet de recharger le navigateur lorsque vous enregistrez des fichiers non CSS."
            },
            {
                "name": "Panneaux inférieurs redimensionnables",
                "description": "Les panneaux de résultats de recherche et JSLint peuvent désormais être redimensionnés verticalement."
            },
            {
                "name": "Recherche incrémentielle",
                "description": "Met en évidence le premier résultat trouvé dès que vous saisissez du texte dans la boîte de dialogue Rechercher."
            },
            {
                "name": "Supprimer la ligne",
                "description": "Utilisez la combinaison Ctrl+Maj+D ou ⌘⇧D pour supprimer la ou les lignes actives en cas de sélection."
            },
            {
                "name": "Indicateurs de code pour adresses URL relatives",
                "description": "Les attributs href et src indiquent les chemins d’accès relatifs des fichiers sur le disque."
            },
            {
                "name": "Nouveau dossier",
                "description": "Pour créer un dossier, cliquez sur l’option de menu Fichier > Nouveau dossier, ou cliquez avec le bouton droit dans l’arborescence du projet."
            },
            {
                "name": "Renommer des fichiers et des dossiers",
                "description": "Dans l’arborescence du projet, cliquez avec le bouton droit sur un fichier ou un dossier, puis sélectionnez Renommer."
            },
            {
                "name": "Afficher dans l’arborescence de fichiers",
                "description": "Cliquez sur Naviguer > Afficher dans l’arborescence de fichiers pour mettre en évidence le fichier en cours."
            },
            {
                "name": "Nouvelles traductions",
                "description": "Des traductions en italien et en portugais brésilien sont désormais disponibles grâce aux contributions de la communauté d’utilisateurs."
            }
        ]
    },
    {
        "buildNumber": 3791,
        "versionString": "Sprint 14",
        "dateString": "20-9-2012",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-14",
        "downloadURL": "https://github.com/adobe/brackets/downloads",
        "newFeatures": [
            {
                "name": "Nouvelle police de l’Editeur : Source Code Pro",
                "description": "Brackets utilise désormais une nouvelle police monospace gratuite, appelée Source Code Pro."
            },
            {
                "name": "Menu Aide",
                "description": "Eléments du menu de débogage \"Afficher le dossier d’extensions\" et \"Rechercher les mises à jour\" déplacés vers un nouveau menu Aide."
            },
            {
                "name": "Flux de travaux de développement amélioré",
                "description": "Consultez le fichier README brackets-shell."
            },
            {
                "name": "Localisation en français terminée",
                "description": "L’application et le programme d’installation existent désormais en français."
            },
            {
                "name": "Informations de version",
                "description": "Les informations de version sont accessibles via le menu Aide > A propos."
            }
        ]
    }
]
