[
    {
        "buildNumber": 10000000,
        "versionString": "Update",
        "dateString": "12-11-2012",
        "releaseNotesURL": "TODO",
        "downloadURL": "https://creative.adobe.com/apps",
        "newFeatures": [
            {
                "name": "Editor: Inline Color Picker",
                "description": "When the cursor is on a hex, rgb() or hsl() color, you can use Ctrl-E or ⌘E to edit the color inline."
            },
            {
                "name": "Editor: Indentation Preferences",
                "description": "Toggle between indenting with tabs or spaces and set the indentation size from the status bar."
            },
            {
                "name": "Editor: New Code Editing Commands",
                "description": "Use Ctrl-Shift-/ or ⌘⇧/ to toggle block comments and Ctrl-Shift-D or ⌘⇧D to delete lines."
            },
            {
                "name": "Editor: Code Hints for Relative URLs",
                "description": "While typing an href or src attribute in HTML, code hints show you relative paths for files on disk."
            },
            {
                "name": "Editor: Incremental Find",
                "description": "The editor now highlights the first matching result when typing in the Find dialog."
            },
            {
                "name": "Editor: Improved Quick Open",
                "description": "Quick Open now searches on the whole path (not just filename), and accepts CamelCase abbreviations and other non-contiguous matches."
            },
            {
                "name": "Live Preview: CSS Highlighting",
                "description": "While Live Preview is active, putting the cursor in a rule in a CSS file highlights items affected by that rule in the browser."
            },
            {
                "name": "Live Preview: Auto Reload",
                "description": "Live Preview now reloads the browser when saving non-CSS files."
            },
            {
                "name": "Live Preview: Local Server Support",
                "description": "You can now use Live Preview with server-based content by specifying a base URL in Project Settings."
            },
            {
                "name": "Sidebar: Find in File or Folder",
                "description": "Search in a specific file or folder by choosing \"Find in…\" from the context menu in the file tree."
            },
            {
                "name": "Sidebar: File Tree Improvements",
                "description": "You can now create new folders and rename files or folders from the file tree context menu, and highlight the current file in the file tree using Navigate > Show in File Tree."
            },
            {
                "name": "Sidebar: Working Set Sorting and Reordering",
                "description": "Sort by name, type or time added by choosing an option from the context menu. Also, the working set may be reordered using drag and drop."
            },
            {
                "name": "UI: Status Bar",
                "description": "Displays cursor info, file size, file type, JSLint notification, and indentation preferences."
            },
            {
                "name": "UI: Resizable Bottom Panels",
                "description": "Search Results and JSLint panels can now resize vertically."
            },
            {
                "name": "Extensions: Per-User Storage",
                "description": "Extensions are now stored in per-user folders instead of inside the application folder. Windows: C:\\Users\\<user>\\AppData\\Roaming\\Brackets\\extensions. Mac: /Users/<user>/Library/Application Support/Brackets/extensions."
            }
        ]
    }
]